; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 935628 2 1 3 4 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image2 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star3 - direction
	Phenomenon4 - direction
	Star5 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(pointing satellite0 GroundStation2)
	(pointing satellite1 GroundStation0)
	(have_image Phenomenon4 spectrograph0)
	(have_image Star5 image2)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 4
3. (turn_to satellite1 star3 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star3)
   goals met: 0 of 4
4. (turn_to satellite0 groundstation0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 4
5. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 0 of 4
6. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 4
7. (turn_to satellite1 phenomenon4 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon4)
   goals met: 0 of 4
8. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 4
9. (take_image satellite1 phenomenon4 instrument1 spectrograph0)
   added: (have_image phenomenon4 spectrograph0)
   goals met: 2 of 4
10. (turn_to satellite0 star5 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star5)
   goals met: 1 of 4
11. (turn_to satellite1 groundstation0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 groundstation0)
   goals met: 2 of 4
12. (take_image satellite0 star5 instrument0 image2)
   added: (have_image star5 image2)
   goals met: 3 of 4
13. (turn_to satellite0 groundstation2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation2)
   goals met: 4 of 4
